[
  {
    "image": "https://play-lh.googleusercontent.com/2Z9iB6i7PQqz5jAqgjSxq5qM7aUgP59B_6l5LtmvBzZ9Gv2FOWmzY7F8vghzrmzJk6k=w240-h480",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "Instagram is a social media platform that allows users to share photos, videos, and stories with their friends and followers. It offers multiple creative tools such as filters, editing options, and interactive stickers to enhance posts. Users can engage with content via likes, comments, and direct messaging. Instagram provides personalized feeds through its AI-driven algorithm, enabling users to discover new content based on interests and engagement history. The app supports IGTV for long-form videos, Reels for short video clips, and Shopping to purchase products directly. Stories disappear after 24 hours but can be saved as highlights. Instagram also provides insights for creators and businesses to track engagement, growth, and performance metrics. The platform emphasizes community building, creative expression, and instant sharing of moments. Privacy and security settings allow users to control who can view their posts and interact with them. Frequent updates improve usability, enhance security, and introduce new features that maintain user engagement. Instagram continues to be a leading social media app globally for connecting people, exploring trends, and sharing life moments effectively.",
    "size": 42,
    "reviews": 4210000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 52000
      },
      {
        "name": "2 star",
        "count": 34000
      },
      {
        "name": "3 star",
        "count": 120000
      },
      {
        "name": "4 star",
        "count": 600000
      },
      {
        "name": "5 star",
        "count": 3200000
      }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/dY6z4UrX6X4W4ZnDxRxD2ipA9c4hXoF1Kf5KzP2Z_kKxB1LfZ8U1GFd7OVqZLo34vA=w240-h480",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "id": 2,
    "description": "Spotify is a music streaming platform that gives users access to millions of songs, podcasts, and playlists from all over the world. It offers both free and premium subscription tiers, with premium removing ads and allowing offline listening. Users can create, share, and follow playlists, explore curated playlists for mood, genre, and activity, and enjoy personalized recommendations through its advanced algorithm. Spotify supports collaborative playlists so multiple users can add tracks. Podcasts cover diverse topics, enabling users to listen to news, entertainment, and educational content. The app features a powerful search function to discover artists, albums, and tracks. Integration with devices such as smart speakers, wearables, and cars allows seamless playback across platforms. Spotify's social features include sharing music and following friends or favorite artists to see their listening activity. The app continually updates with new features and music releases. Spotify emphasizes music discovery, personalization, and social sharing, making it one of the leading streaming platforms globally.",
    "size": 65,
    "reviews": 3100000,
    "ratingAvg": 4.7,
    "downloads": 800000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 30000
      },
      {
        "name": "2 star",
        "count": 20000
      },
      {
        "name": "3 star",
        "count": 70000
      },
      {
        "name": "4 star",
        "count": 250000
      },
      {
        "name": "5 star",
        "count": 2600000
      }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/QiTrUYr33fqTg0bXPCm4K_3tqLYIM2x9LPk_hHus09r6Vq0OmVQimfLgUyz9BvFJrA=w240-h480",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "WhatsApp Messenger is a globally popular messaging app that allows users to communicate instantly using text, voice, and video messages. It provides end-to-end encryption to secure private conversations and supports group chats for family, friends, or professional teams. Users can share multimedia such as photos, videos, documents, and location with others seamlessly. WhatsApp offers voice and video calling with high-quality audio and video across devices and networks. The app also includes WhatsApp Web for desktop use. Features like status updates allow users to post temporary messages viewable by contacts. WhatsApp supports international communication without extra charges and requires only an internet connection. Business accounts allow companies to interact with customers efficiently using automated replies, catalogs, and support tools. The platform ensures ease of communication, reliability, and user security. Regular updates improve stability, add new features, and maintain strong privacy standards. WhatsApp remains one of the most widely used messaging apps worldwide, emphasizing simplicity, speed, and secure communication for users of all ages.",
    "size": 55,
    "reviews": 5000000,
    "ratingAvg": 4.6,
    "downloads": 5000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 40000
      },
      {
        "name": "2 star",
        "count": 30000
      },
      {
        "name": "3 star",
        "count": 100000
      },
      {
        "name": "4 star",
        "count": 500000
      },
      {
        "name": "5 star",
        "count": 3900000
      }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/QK9Jf02q4Quo1T0Dhhxk5qDlFQHkI4U6O9XLp6Fj1X7whF7YY6s5v7OrYJQxF5d9PO8=w240-h480",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 4,
    "description": "TikTok is a short-form video platform where users can create, edit, and share videos ranging from 15 seconds to 3 minutes. It offers a variety of music tracks, filters, effects, and editing tools to make creative and entertaining content. TikTok’s AI-powered feed recommends videos based on user interests and engagement patterns, making content discovery highly personalized. The platform supports trends, challenges, and viral hashtags to increase engagement and visibility. Users can comment, like, and share videos, as well as follow favorite creators. TikTok also includes a Live feature for real-time interactions and monetization opportunities for creators. Security and privacy settings allow users to control who can view or comment on their content. TikTok emphasizes creativity, entertainment, and community building. Regular updates bring new effects, editing tools, and features to enhance user experience. Its algorithm ensures that users discover engaging and trending content consistently. With millions of creators and viewers worldwide, TikTok remains a leading app for video content, entertainment, and social engagement.",
    "size": 60,
    "reviews": 4200000,
    "ratingAvg": 4.4,
    "downloads": 1500000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 35000
      },
      {
        "name": "2 star",
        "count": 25000
      },
      {
        "name": "3 star",
        "count": 90000
      },
      {
        "name": "4 star",
        "count": 300000
      },
      {
        "name": "5 star",
        "count": 3750000
      }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/6ZtXkD8BkkYIDpGQ7JG7NNkMZC7hqA_8GME5DgLv5DrFEr8R2NQxB0dGGg9L2gq6dcw=w240-h480",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 5,
    "description": "Snapchat is a multimedia messaging app focused on ephemeral content, allowing users to send photos and videos that disappear after viewing. It features Stories, which let users post content visible for 24 hours, and Snap Map to share location with friends. The app provides filters, lenses, and augmented reality effects for fun, creative interactions. Chat features include text, voice, and video messages, supporting private conversations and group chats. Snapchat’s Discover section offers news, entertainment, and creator content. It emphasizes privacy, playful communication, and social engagement. Users can customize profiles and manage who can view their content. Snapchat regularly updates with new features, filters, and interactive tools, keeping the platform engaging. The app is popular for its interactive AR filters, streaks system, and real-time sharing. Snapchat continues to provide a unique social experience for personal expression, creativity, and instant communication, especially among younger audiences. It is widely used globally as a social media app for both casual and interactive engagement.",
    "size": 52,
    "reviews": 3100000,
    "ratingAvg": 4.1,
    "downloads": 1000000000,
    "ratings": [
      {
        "name": "1 star",
        "count": 25000
      },
      {
        "name": "2 star",
        "count": 20000
      },
      {
        "name": "3 star",
        "count": 65000
      },
      {
        "name": "4 star",
        "count": 210000
      },
      {
        "name": "5 star",
        "count": 2740000
      }
    ]
  }
]